[
  {
    "title": "WatchStuff",
    "description": "A Youtube skeleton clone built with React, Redux and the Youtube API.  Uses Redux Saga middleware to help manage Redux state.  Implements features such as lazy loading results, search functionality, trending videos, liked and saved videos. \\n\\n Built for learning purposes and personal use.",
    "tech": ["React", "Redux", "Youtube API", "Netlify", "Sass", "Semantic UI"],
    "link": "watchstuff.netlify.com/"
  },
  {
    "title": "Portfolio",
    "description": "The website you're on right now!  Built from scratch using Gatsby and React.  Integrated with Contentful as a CMS and deployed on Netlify.",
    "tech": [
      "React",
      "Gatsby",
      "GraphQL",
      "Contentful",
      "Netlify",
      "Styled-Components",
      "GSAP"
    ],
    "link": "zswportfolio.netlify.com"
  },
  {
    "title": "Github Issue Tracker",
    "description": "App that tracks repository issues on Github.  Built for learning purposes with Apollo and React.  This project served as my introduction to GraphQL and Apollo. \\n\\n Features include search functionality, optimistic UI updates, server-side result filtering, like/unlike and commenting.",
    "tech": ["React", "Apollo", "GraphQL", "Netlify"],
    "link": "zsw-github-issue-tracker.netlify.com"
  },
  {
    "title": "DevConnector",
    "description": "Full stack social networking app.  Built using React, Redux, Express and MongoDb.  Features user authentication with Passport using JSON web tokens.  Deployed on Heroku. \\n\\n Built for learning purposes, primarily as an introduction to back-end development.  Learned the basics of Node, MongoDb and authentication using JSON web tokens.",
    "tech": [
      "React",
      "Redux",
      "Express",
      "Node",
      "MongoDb",
      "Heroku",
      "Passport"
    ],
    "link": "poke-master-connector.herokuapp.com"
  },
  {
    "title": "Chartizard",
    "description": "A fun, beginner project biult for learning purposes.  Assigned from Treehouse Tech Degree Program (www.teamtreehouse.com).",
    "tech": ["HTML", "CSS"],
    "link": "github.com/ZeeEssDoubleU/Treehouse-Project-9-Web-App-Dashboard"
  }
]
